import React from 'react';
import './MiddleSection.css'; 
import descrpimg1 from '../assets/descrpimg1.jpg';
import descrpimg2 from '../assets/descrpimg2.jpg';


const MiddleSection = () => {
  return (
    <div className="middle-section">
      {/* Part 1: Two Columns */}
      <div className="part-1">
        <div className="column-1">
          <h2 className="title-1">කතරගම දේවාල</h2>
          <h2 className="title-2">ඉතිහාස</h2> 
          <h2 className="title-2">වෘත්තාන්තය</h2>
          <p className="paragraph">
          හින්දු දේව පුරාණයන්ට අනුව ශිව දෙවියන්ගේ හා පාර්වතී මෑණියන්ගේ පුතු වූ ද ගණේශ් දෙවිගේ සොහොයුරු වූ ද “ස්කන්ධ” නම් වූ දෙවියන් උපත ලබන ලද්දේ අසුරය බලය පරාජය කිරීමේ අරමුණ ඇතිවය. ඒ අනුව අසුර බලය පරාජය කළ මේ බලගතු දෙව් කුමාරයා, දේව සේනාධිපති ලෙස නම් කරන ලදී. මේ ස්කන්ධ දෙවියන් පසු කළෙක ලක්දිවට පැමිණි අතර වර්තමාන සෙල්ලකතරගම ප්‍රදේශයේ දී “වල්ලි” නම් වූ රූමත් වැදි යුවතියක් හමු වී ඇය පිළිබඳ ප්‍රේම සිතක් පහළ වී ඇයව විවාහ කර ගන්නා ලදී. පසුව එම දෙපල කතරගම ප්‍රදේශයේ ම විසූහ. එතැන් පටන් මෙම ස්කන්ධ දෙවියන් කතරගම දෙවියන් යන නාමයෙන් ද හඳුන්වන ලදී.
          </p>
          <p className="paragraph">
          වර්තමානයේ පවතින ප්‍රධාන දේවාලය ඉදි වීමේ කතා ප්‍රවෘත්තිය ක‍්‍රි. පූ. දෙවන ශතවර්ෂයේදී සිරිලක එක්සේසත් කළ ගැමුණු මහ රජුගේ කාළයට අයත් වේ. ගැමුණු රජු එළාර රජුගෙන් අනුරාධපුර රාජ්‍ය මුදවා ගැනීම සඳහා මාගම සිට අනුරාධපුරය බලා සේනාව සමඟ ගමන් කරන අතර තුර මෙම පිංබිමේදී කතරගම දෙවියන් මුණගැසී ඇති අතර, ඒ මොහොතේ දී රජු යුධ ජයග‍්‍රණය කිරීමට ආශිර්වාද කරන ලෙස දෙවියන්ගෙන් ඉල්ලා ඇත. එ් අනුව කතරගම දෙවියන්ගේ ද උපකාරය ලත් රජු දේශය එක්සේසත් කොට නැවත කතරගමට පැමිණ දෙවිහාමුදුරුවන්ට කෘතගුණ සැලකීම වශයෙන් සිදු කළ යුත්තේ කුමක් දැයි විමසා ඇත.
          </p>
        </div>
        <div className="column-2">
          <img
            src={descrpimg1}
            alt="Image"
            className="image"
          />
          <p className="paragraph">
          වැඩසිටි කන්දේ සිට හී සරයක් එවා එය බිම පතිත වන ස්ථානයේ දෙවොලක් සාදන ලෙස දෙවිහාමුදුරුවන් ප‍්‍රකාශ කළ අතර, ඒ අනුව දුටුගැමුණු මහරජු විසින් එය එසේම ඉෂ්ඨ-සිද්ධ කිරීමට සියල්ල සම්පාදනය කර මහ දේවාලය ඉදි කරන ලදී. එහි දී දෙවිහාමුදුරුවන් වෙනුවෙන් තේවාකටයුතු කිරීමේ වගකීම හෙවත් දෙවාලයේ ප්‍රධාන කපු පදවිය නන්දිමිත්‍ර මහ යෝධයාට පරවන ලදුව අදත් එම දරුමුණුපුරු පරම්පරාව විසින් එම වගකීම දරනු ලබයි. දෙවිහාමුදුරුවන්ගේ හා දේවාලයේ භාරකාරීකාරීත්වය බස්නායක නිලමේවරයා වෙත පවරන ලදී.
          </p>
          <p className="paragraph">
          එවක පටන් අද දක්වා සිය දහස් ජනීජනයාගේ පුද පූජා ලබමින් සතට සෙත සලසමින් කතරගම දෙවිහාමුදුරුවන් වහන්සේ මෙහි වැඩ වසන සේක.
          </p>
        </div>
      </div>

      {/* Part 2: YouTube Video */}
      <div className="part-2">
        <iframe
          title="YouTube Video"
          width="100%"
          height="760"
          src="https://www.youtube.com/embed/zXc7lpe_D0w?si=kbhvUvbNW2MRYZi3"
          frameborder="0"
          allowfullscreen
        ></iframe>
      </div>

      {/* Part 3:  Image */}
      <div className="part-3">
        <img
          src={descrpimg2}
          alt="Image"
          className="simple-image"
        />
      </div>
    </div>
  );
};

export default MiddleSection;
